---
kind: property
id: P:Autodesk.Revit.DB.ConnectorElement.Height
zh: 高度
source: html/03719a7b-3a05-7d63-8b92-0fbe6474b046.htm
---
# Autodesk.Revit.DB.ConnectorElement.Height Property

**中文**: 高度

The height of the connector.

## Syntax (C#)
```csharp
public virtual double Height { get; }
```

## Remarks
-1 if the connector is round.